artillery-basic-load-test.yml
config:
  target: '{{ $processEnvironment.API_BASE_URL || "http://localhost:3000" }}'
  phases:
    - duration: 60
      arrivalRate: 50
      name: "Warm up"
    - duration: 120
      arrivalRate: 200
      name: "Ramp up to 200 RPS"
    - duration: 300
      arrivalRate: 500
      name: "Peak load - 500 RPS"
    - duration: 120
      arrivalRate: 300
      name: "Sustained load"
    - duration: 60
      arrivalRate: 50
      name: "Cool down"

scenarios:
  - name: "Vault API Load Test"
    weight: 80
    flow:
      - get:
          url: "/api/vaults"
          headers:
            Content-Type: "application/json"
          qs:
            limit: 50
            offset: "{{ $randomInt(0, 10) * 50 }}"
          capture:
            - json: "$.data[*].id"
              as: "vaultIds"
            - json: "$.data.length"
              as: "vaultCount"
      - think: "{{ $randomInt(1, 3) }}"
      - loop:
          - get:
              url: "/api/vaults/{{ vaultIds[$randomInt(0, {{ vaultCount - 1 }})] }}"
              headers:
                Content-Type: "application/json"
          - think: "{{ $randomInt(0, 2) }}"
        count: "{{ $randomInt(1, 3) }}"

  - name: "Health Check Load Test"
    weight: 20
    flow:
      - get:
          url: "/health"
          headers:
            Content-Type: "application/json"
      - think: "{{ $randomInt(0, 1) }}"